app/controllers/accounts_controller.rb

SELECT `servers`.* FROM `servers` WHERE `servers`.`current` = 1 LIMIT 1
INSERT INTO `accounts` (`account_type`, `address`, `billing_type`, `city`, `country`, `created_at`, `created_by`, `customer_code`, `email`, `first_name`, `last_name`, `name`, `password`, `phone`, `postal_code`, `province`, `status`, `trial_period`, `updated_at`, `updated_by`) VALUES (0, '55 Water Street, Suite 503', 0, 'Vancouver', 'CA', '2012-03-07 00:16:56', 'admin', NULL, 'scotth@rkosolutions.com', 'C. Montgomery', 'Burns', 'Springfield Nuclear Power Plant', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', NULL, 'V6B 1A1', 'BC', 0, 60, '2012-03-07 00:16:56', 'admin')
INSERT INTO `zone_nodes` (`account_id`, `created_at`, `current_disk_space`, `current_users`, `deployed`, `fingerprint`, `max_disk_space`, `max_users`, `name`, `server_id`, `status`, `subdomain`, `template_id`, `updated_at`) VALUES (1, '2012-03-07 00:16:57', 0, 0, 0, '3cf6ec50ce7484a93e9148ca8a058314d5a8ea4d', 12884901888, 3, 'Springfield Nuclear Power Plant', 1, 0, 'nuke', 1, '2012-03-07 00:16:57')
---
  def create

    begin

      Account.transaction do

        @server = Server.where(:current => true).first
        raise "A VersaFile server has not been defined" if @server.nil?

        #1) Create account => set status to "Pending"
        @account = Account.new(params[:account])
        @account.trial_period = ((@account.account_type == VersaFile::AccountTypes.Trial) ? @account.trial_period : VersaFile::TrialStates.NoTrial)
        @account.status = VersaFile::AccountStates.Pending
        @account.created_by = @super_user.name
        @account.updated_by = @super_user.name

        unless @account.save
          raise_errors(@account.errors)
        end

        #2) Create ZoneNode(s) - don't deploy it yet
        params[:subdomains].each do |subdomain|

          @zone_node = @account.zone_nodes.create(
            :server => @server,
            :name => @account.name,
            :template_id => (params[:template].nil? ? VersaFile::CreationTemplates.None : params[:template]),
            :subdomain => subdomain[:name],
            :status => 0,
            :current_users => 0,
            :max_users => subdomain[:user_quota],
            :current_disk_space => 0,
            :max_disk_space => subdomain[:disk_quota].to_i * VersaFile::DiskSizes.Gigabyte,
            :deployed => false
          )

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`email` = 'scotth@rkosolutions.com' AND (status & 32768 = 0) LIMIT 1
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 0 AND (status & 32768 = 0) LIMIT 1
---
  def update

    begin

      update_zone = false
      deploy_zone = false

      @account = Account.active.find_by_email(params[:id])
      @account = Account.active.find(params[:id]) if @account.nil?

UPDATE `accounts` SET `account_type` = 0, `trial_period` = 127, `updated_at` = '2012-03-01 01:02:12' WHERE `accounts`.`id` = 1
---
        @account[:updated_by] = @account_user.instance_of?(RkoUser) ? @account_user.name : @account_user.email

        update_zone |= @account.trial_period_changed?
        unless @account.save

SELECT `zone_nodes`.* FROM `zone_nodes` WHERE `zone_nodes`.`account_id` = 1
---
        #Update remote zone information
        logger.debug("UPDATE ZONE???? :> #{update_zone}")
        if update_zone
          @account.zone_nodes.each do |zone_node|