app/controllers/choice_lists_controller.rb

  def index

    sort = ChoiceListsHelper::generate_sort(params)

    @choice_lists = @library.choice_lists.all(
        :order => sort
    )
---
SELECT `choice_lists`.* FROM `choice_lists` WHERE `choice_lists`.`library_id` = 1