app/controllers/document_types_controller.rb

SELECT `document_types`.* FROM `document_types` WHERE `document_types`.`library_id` = 1
---
  def index

    @document_types = @library.document_types.all