app/controllers/documents_controller.rb

  def index

    @query_type = params[:type].nil? ? Bfree::SearchTypes.None : params[:type].to_i
    @view = @library.view_definitions.find_by_id(params[:view])
    @documents = []
    @query = nil

    sort = DocumentsHelper::generate_sort(params)
    range = DocumentsHelper::generate_range(request)

      case @query_type
        when Bfree::SearchTypes.Folder
          @folder = @library.folders.find_by_id(params[:query])
          @query = @library.documents.viewable(@active_user, @active_group).active.in_folder(@folder)
        when Bfree::SearchTypes.Trash
          @query = @library.documents.viewable(@active_user, @active_group).deleted
        when Bfree::SearchTypes.Simple
          @simple_text = params[:query]
          @query = @library.documents.viewable(@active_user, @active_group).simple(@simple_text)
        when Bfree::SearchTypes.Advanced
          @advanced = ActiveSupport::JSON.decode(params[:query])
          @query = @library.documents.viewable(@active_user, @active_group).advanced(@library, @advanced)
      end

      @count = @query.nil? ? 0 : @query.count
---
SELECT COUNT(*) FROM `documents` INNER JOIN ( SELECT acls.securable_id AS id, roles.permissions AS active_permissions FROM `acls` INNER JOIN (

  def create

    Document.transaction do

      isMinorVersion = params[:isMinorVersion].nil? ? false : params[:isMinorVersion]
      unique_id = params[:authenticity_token]

      @document_type = @library.document_types.find(params[:document_type_id]);
      @folder = (params[:folder_id].nil? || params[:folder_id] == 0) ? nil : @library.folders.viewable(@active_user, @active_group).find(params[:folder_id])
---
SELECT `folders`.* FROM `folders` WHERE `folders`.`id` = 0 LIMIT 1