app/controllers/documents_controller.rb

  def index



    @documents = []

    if params[:view].blank?
      @view_definition = @library.view_definitions.first
    else
      @view_definition = @library.view_definitions.find(params[:view])
    end
    @cell_definitions = @view_definition.cell_definitions.all

    columns = DocumentsHelper::generate_columns(params)
    joins = DocumentsHelper::generate_joins(params)
    sort = DocumentsHelper::generate_sort(params)
    range = DocumentsHelper::generate_range(request)

    @count = 0
    @documents = []

    @library=@zone.libraries.viewable(@active_user, @active_group).find(:all, :conditions=>{:id=>params[:library_id]})
    if(@library.length==0)
      @documents=[]
    else
      @library=@library.first
      case params[:type].to_i

        when Bfree::SearchTypes.Folder
          @folder = @library.folders.find_by_id(params[:query])
---
SELECT `cell_definitions`.* FROM `cell_definitions` WHERE `cell_definitions`.`view_definition_id` = 1 ORDER BY column_order
SELECT `view_definitions`.* FROM `view_definitions` WHERE `view_definitions`.`library_id` = 1 AND `view_definitions`.`id` = 3 LIMIT 1
SELECT `libraries`.* FROM `libraries` WHERE `libraries`.`zone_id` = 1 AND `libraries`.`id` = 1 LIMIT 1
SELECT libraries.*, viewable.active_permissions FROM `libraries` INNER JOIN ( SELECT acls.securable_id AS id, roles.permissions AS active_permissions FROM `acls` INNER JOIN (
SELECT `folders`.* FROM `folders` WHERE `folders`.`library_id` = 1 AND `folders`.`id` IS NULL LIMIT 1

  def create

    begin

      Document.transaction do

        isMinorVersion = params[:isMinorVersion].nil? ? false : params[:isMinorVersion]
        unique_id = params[:authenticity_token]

        @document_type = @library.document_types.find(params[:document_type_id]);
---
SELECT `document_types`.* FROM `document_types` WHERE `document_types`.`library_id` = 1 AND `document_types`.`id` = 1 LIMIT 1
SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1

          @version.binary_content_type=params[:current_version][:binary_content_type]
        end

        unless @document.save
---
UPDATE `documents` SET `body` = '', `metadata` = 'Chroma BlackIsZero: true\nChroma ColorSpaceType: RGB\nChroma NumChannels: 4\nCompression CompressionTypeName: deflate\nCompression Lossless: true\nCompression NumProgressiveScans: 1\nContent-Length: 6001\nContent-Type: image/png\nData BitsPerSample: 8 8 8 8\nData PlanarConfiguration: PixelInterleaved\nData SampleFormat: UnsignedIntegral\nDimension ImageOrientation: Normal\nDimension PixelAspectRatio: 1.0\nIHDR: width=64, height=64, bitDepth=8, colorType=RGBAlpha, compressionMethod=deflate, filterMethod=adaptive, interlaceMethod=none\nTransparency Alpha: nonpremultipled\nheight: 64\nresourceName: a63cc6ef2ee37d36db6851534d91f2199df775a3.png\ntiff:BitsPerSample: 8 8 8 8\ntiff:ImageLength: 64\ntiff:ImageWidth: 64\nwidth: 64\n', `custom_metadata` = 'SharedFile001.png', `updated_at` = '2012-03-07 00:20:36' WHERE `documents`.`id` = 1