app/controllers/folders_controller.rb

  def show

    #if(params[:id].index("db")!=nil)
    #  uid, path=DropboxHelper.parse_id(params[:id])
    #
    #  sezzion=@library.db_sessions.find_by_dropbox_uid(uid)
    #  dbsession=sezzion.getSession()
    #
    #  dbclient=DropboxClient.new(dbsession, configatron.versafile.dropbox.access_type)
    #  dbaccount=dbclient.account_info()
    #
    #  meta=dbclient.metadata(path)
    #
    #  @folder=@library.folders.new(
    #      :name=>meta['path'].length==1 ? dbaccount['display_name'] : meta['path'].slice((meta['path'].rindex('/')+1)..meta['path'].length),
    #      :folder_type=>meta['path'].length==1 ? VersaFile::FolderTypes.DropboxAccount : VersaFile::FolderTypes.DropboxFolder
    #  )
    #  @folder.id='db'+dbaccount['uid'].to_s+"-"+meta['path'].to_s.gsub("/",">")
    #else
    @folder = @library.folders.viewable(@active_user, @active_group).find(params[:id])

    if(@folder.folder_type==VersaFile::FolderTypes.DropboxRoot)
      @library.db_sessions.each do |dbsess|
---
SELECT `folders`.* FROM `folders` WHERE `folders`.`id` = 4 LIMIT 1
SELECT folders.*, viewable.active_permissions FROM `folders` INNER JOIN ( SELECT acls.securable_id AS id, roles.permissions AS active_permissions FROM `acls` INNER JOIN (

            folder=@library.folders.find_by_dropbox_uid_and_dropbox_path(account['uid'], childmeta['path'])

            if(folder==nil)
              folder = @zone.folders.new(
                :library => @library,
                :name => childmeta['path'].slice((childmeta['path'].rindex('/')+1)..childmeta['path'].length),
                :folder_type => VersaFile::FolderTypes.DropboxFolder,
                :created_by => 'Dropbox',
                :updated_by => 'Dropbox',
                :parent_id => @folder_account.id,
                :dropbox_uid => account['uid'],
                :dropbox_path => childmeta['path']
              )
---
SELECT COUNT(*) FROM `folders` WHERE `folders`.`parent_id` = 6
SELECT `libraries`.* FROM `libraries` WHERE `libraries`.`zone_id` = 1 AND `libraries`.`id` = 1 LIMIT 1