app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups` WHERE `groups`.`zone_id` = 1 AND `groups`.`id` = 1 LIMIT 1
---
  def show

    @group = @zone.groups.find(params[:id])