app/controllers/icons_controller.rb

  def show
    file_name = 'default.png'
    size = 16.to_s
    @icon = Icon.find_by_content_type(params[:id])
---
SELECT `icons`.* FROM `icons` WHERE `icons`.`content_type` = 'image/png' LIMIT 1