app/controllers/libraries_controller.rb

SELECT `libraries`.* FROM `libraries` WHERE `libraries`.`zone_id` = 1 AND `libraries`.`id` = 1 LIMIT 1
---
  def show
    begin
      @library = @zone.libraries.find(params[:id])