app/controllers/operators_controller.rb

  def index
    @operators = Operator.all
---
SELECT `operators`.* FROM `operators`