app/controllers/property_definitions_controller.rb

  def index

    sort = PropertyDefinitionsHelper::generate_sort(params)

    @property_definitions = @library.property_definitions.all(
        :order => sort
    )
---
SELECT `property_definitions`.* FROM `property_definitions` WHERE `property_definitions`.`library_id` = 1