app/controllers/rko_users_controller.rb

  def index

    @rko_users = RkoUser.all
---
SELECT `rko_users`.* FROM `rko_users`

  def show

    @rko_user = RkoUser.find(params[:id])
---
SELECT `rko_users`.* FROM `rko_users` WHERE `rko_users`.`id` = 1 LIMIT 1

  def logon

    begin

      raise Exceptions::InvalidCredentials.new(params[:username]) if params[:username].blank?
      @rko_user = RkoUser.find_by_name(params[:username])
---
SELECT `rko_users`.* FROM `rko_users` WHERE `rko_users`.`name` = 'admin' LIMIT 1