app/controllers/servers_controller.rb

  def index
    @servers = Server.all
---
SELECT `servers`.* FROM `servers`

  def create
    @server = Server.new(params[:server])

    respond_to do |format|
      if @server.save
---
INSERT INTO `servers` (`active`, `created_at`, `current`, `host`, `name`, `port`, `protocol`, `updated_at`) VALUES (0, '2012-03-07 00:15:41', 1, 'www.bfreetest.com', 'bfreetest.dev', 3001, 'http', '2012-03-07 00:15:41')

  def update
    @server = Server.find(params[:id])

    @server.attributes=params[:server]

    respond_to do |format|
      if @server.save
---
SELECT `servers`.* FROM `servers` WHERE `servers`.`id` = 1 LIMIT 1
UPDATE `servers` SET `current` = 0, `created_at` = '2012-02-29 18:19:02', `updated_at` = '2012-02-29 18:19:02' WHERE `servers`.`id` = 1