app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`zone_id` = 1 AND `users`.`id` = 1 LIMIT 1
---
  def show

    @user = @zone.users.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`zone_id` = 1 AND `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `password` = '1e47b92cd0ac30ee7e7a670bd61f870d90735ded', `password_expires` = NULL, `updated_at` = '2012-03-07 00:18:12' WHERE `users`.`id` = 1
SELECT 1 FROM `groups` INNER JOIN `groups_users` ON `groups`.`id` = `groups_users`.`group_id` WHERE `groups_users`.`user_id` = 1 AND `groups`.`id` = 1 LIMIT 1
---
  def update

      @user = @zone.users.find(params[:id])

      User.transaction do

        @user.update_attributes(
          :first_name => params[:first_name],
          :last_name => params[:last_name],
          :email => params[:email],
          :updated_by => @active_user.name
        )

        if params[:active_group].nil?
          @user.switch_to_group(nil)
        else
          @group = @zone.groups.find(params[:active_group])