app/controllers/view_definitions_controller.rb

SELECT `libraries`.* FROM `libraries` WHERE `libraries`.`zone_id` = 1 AND `libraries`.`id` = 1 LIMIT 1
SELECT `cell_definitions`.* FROM `cell_definitions` WHERE `cell_definitions`.`view_definition_id` = 3 ORDER BY column_order
SELECT `view_definitions`.* FROM `view_definitions` WHERE `view_definitions`.`library_id` = 1 ORDER BY name
---
  def index

    @library = @zone.libraries.find(params[:library_id])
    @view_definitions = @library.view_definitions.all(:order => "name")