app/controllers/zone_nodes_controller.rb

  def bfree

    if(request.subdomains.first.downcase == "admin")

      superuser_required()

      if(session[:super_user_id] != nil)
        @active_rko_user = RkoUser.find_by_id(session[:super_user_id])
---
SELECT `rko_users`.* FROM `rko_users` WHERE `rko_users`.`id` = 1 LIMIT 1