app/controllers/zones_controller.rb

SELECT `libraries`.* FROM `libraries` WHERE `libraries`.`zone_id` = 1 LIMIT 1
---
  def show

    @library = @zone.libraries.first

SELECT `libraries`.* FROM `libraries` WHERE `libraries`.`zone_id` = 1 LIMIT 1
---
  def main

    @library = @zone.libraries.first

INSERT INTO `zones` (`created_at`, `created_by`, `fingerprint`, `name`, `subdomain`, `updated_at`, `updated_by`) VALUES ('2012-03-07 00:17:02', 'admin', '3cf6ec50ce7484a93e9148ca8a058314d5a8ea4d', 'Springfield Nuclear Power Plant', 'nuke', '2012-03-07 00:17:02', 'admin')
UPDATE `users` SET `email` = 'scotth@rkosolutions.com', `password` = 'e58339f0b83dee387aeff4a4dc49c06931ad63e6', `first_name` = 'C. Montgomery', `last_name` = 'Burns', `updated_at` = '2012-03-07 00:17:03' WHERE `users`.`id` = 1
INSERT INTO `configuration_settings` (`configuration_id`, `name`, `value`) VALUES (NULL, 'session_timeout', '1200')
INSERT INTO `configurations` (`configurable_id`, `configurable_type`, `zone_id`) VALUES (NULL, NULL, 1)
INSERT INTO `users` (`created_at`, `created_by`, `email`, `first_name`, `is_admin`, `last_name`, `name`, `password`, `password_expires`, `reset_fingerprint`, `reset_password`, `state`, `updated_at`, `updated_by`, `zone_id`) VALUES ('2012-03-07 00:17:03', 'admin', NULL, NULL, 1, NULL, 'admin', 'd033e22ae348aeb5660fc2140aec35850c4da997', '2012-03-07 00:17:02', NULL, NULL, NULL, '2012-03-07 00:17:03', 'admin', 1)
---
  def create

    begin

      Zone.transaction do

        trial_period = params[:trial_period].nil? ? -1 : params[:trial_period].to_i

        @zone = Zone.create(
          :name => params[:name],
          :subdomain => params[:subdomain],
          :fingerprint => params[:fingerprint],
          :created_by => params[:created_by],
          :updated_by => params[:created_by]
        )

        #set admin info
        @temp_password = User.generate_password
        logger.debug("PASSWORD:> #{@temp_password}")

        @admin = @zone.users.admins.first
        @admin.update_attributes({
          :email => params[:email],
          :password => @temp_password,
          :first_name => params[:first_name],
          :last_name => params[:last_name]
        })

        @zone.configuration.configuration_settings.create([
          { :name => 'user_quota', :value => params[:user_quota].to_s },
          { :name => 'disk_quota', :value => params[:disk_quota].to_s },
          { :name => 'trial_period', :value => trial_period.to_s }
        ])

SELECT `zone_templates`.* FROM `zone_templates` WHERE `zone_templates`.`id` = 1 LIMIT 1
---
                      params[:template_id]

        if ZoneTemplate.exists?(template_id)
          zone_template = ZoneTemplate.find(template_id)

SELECT `configuration_settings`.* FROM `configuration_settings` WHERE `configuration_settings`.`configuration_id` = 1 AND `configuration_settings`.`name` = 'user_quota' LIMIT 1
UPDATE `configuration_settings` SET `value` = '129' WHERE `configuration_settings`.`id` = 5
---
  def update

    begin

      @admin = @zone.users.admins.first

      Zone.transaction do

        send_upgrade_email = false

        @zone.name = params[:name] unless params[:name].nil?

        #update configuration
        cfg_user_quota = @zone.configuration.configuration_settings.find_by_name('user_quota')
        cfg_user_quota.value = params[:user_quota] unless params[:user_quota].nil?
        cfg_disk_quota = @zone.configuration.configuration_settings.find_by_name('disk_quota')
        cfg_disk_quota.value = params[:disk_quota] unless params[:disk_quota].nil?
        cfg_trial_period = @zone.configuration.configuration_settings.find_by_name('trial_period')
        cfg_trial_period.value = params[:trial_period] unless params[:trial_period].nil?

        send_email_active = (cfg_trial_period.value_changed? && (cfg_trial_period.value.to_i < 0))
        send_email_upgrade = ((cfg_trial_period.value_changed? && (cfg_trial_period.value.to_i >= 0)) || cfg_user_quota.value_changed? || cfg_disk_quota.value_changed?)

        @zone.updated_by = params[:updated_by] unless params[:updated_by].nil?